{
  "token_to_id": {
    "</w>": 0,
    "<END>": 1,
    "<PAD>": 2,
    "<START>": 3,
    "<UNK>": 4,
    "a": 5,
    "an": 6,
    "and</w>": 7,
    "ar": 8,
    "are</w>": 9,
    "at": 10,
    "at</w>": 11,
    "c": 12,
    "cat": 13,
    "cats</w>": 14,
    "cl": 15,
    "cle": 16,
    "clean</w>": 17,
    "d": 18,
    "d</w>": 19,
    "da": 20,
    "dai": 21,
    "daily</w>": 22,
    "de": 23,
    "deli": 24,
    "delic": 25,
    "delici": 26,
    "deliciou": 27,
    "delicious</w>": 28,
    "do": 29,
    "dog": 30,
    "dogs</w>": 31,
    "dr": 32,
    "drin": 33,
    "drink": 34,
    "drinking</w>": 35,
    "e": 36,
    "e</w>": 37,
    "eat": 38,
    "eating</w>": 39,
    "ee": 40,
    "f": 41,
    "fl": 42,
    "floo": 43,
    "floor</w>": 44,
    "foo": 45,
    "food</w>": 46,
    "fr": 47,
    "fre": 48,
    "fres": 49,
    "fresh": 50,
    "fresh</w>": 51,
    "g": 52,
    "g</w>": 53,
    "h": 54,
    "ha": 55,
    "has</w>": 56,
    "i": 57,
    "in": 58,
    "ing</w>": 59,
    "is</w>": 60,
    "k": 61,
    "l": 62,
    "li": 63,
    "lik": 64,
    "like</w>": 65,
    "ly</w>": 66,
    "m": 67,
    "man": 68,
    "many</w>": 69,
    "mat": 70,
    "mat</w>": 71,
    "mats</w>": 72,
    "n": 73,
    "n</w>": 74,
    "nee": 75,
    "need</w>": 76,
    "o": 77,
    "on</w>": 78,
    "oo": 79,
    "ou": 80,
    "out": 81,
    "outs": 82,
    "outsi": 83,
    "outsid": 84,
    "outside</w>": 85,
    "p": 86,
    "par": 87,
    "park": 88,
    "park</w>": 89,
    "parks</w>": 90,
    "pe": 91,
    "pea": 92,
    "peac": 93,
    "peace": 94,
    "peacef": 95,
    "peacefu": 96,
    "peaceful": 97,
    "peacefully</w>": 98,
    "pet": 99,
    "pets</w>": 100,
    "pl": 101,
    "pla": 102,
    "play": 103,
    "playe": 104,
    "played</w>": 105,
    "playing</w>": 106,
    "q": 107,
    "qu": 108,
    "qui": 109,
    "quic": 110,
    "quick": 111,
    "quickly</w>": 112,
    "r": 113,
    "r</w>": 114,
    "ran</w>": 115,
    "ru": 116,
    "run": 117,
    "runn": 118,
    "running</w>": 119,
    "s": 120,
    "s</w>": 121,
    "sat</w>": 122,
    "sl": 123,
    "slee": 124,
    "sleep": 125,
    "sleep</w>": 126,
    "sleeping</w>": 127,
    "t": 128,
    "th": 129,
    "the</w>": 130,
    "to": 131,
    "to</w>": 132,
    "toy": 133,
    "toys</w>": 134,
    "tr": 135,
    "tree": 136,
    "trees</w>": 137,
    "u": 138,
    "v": 139,
    "ve": 140,
    "ver": 141,
    "very</w>": 142,
    "w": 143,
    "wat": 144,
    "wate": 145,
    "water</w>": 146,
    "wi": 147,
    "with": 148,
    "with</w>": 149,
    "y": 150,
    "y</w>": 151
  },
  "id_to_token": {
    "0": "</w>",
    "1": "<END>",
    "2": "<PAD>",
    "3": "<START>",
    "4": "<UNK>",
    "5": "a",
    "6": "an",
    "7": "and</w>",
    "8": "ar",
    "9": "are</w>",
    "10": "at",
    "11": "at</w>",
    "12": "c",
    "13": "cat",
    "14": "cats</w>",
    "15": "cl",
    "16": "cle",
    "17": "clean</w>",
    "18": "d",
    "19": "d</w>",
    "20": "da",
    "21": "dai",
    "22": "daily</w>",
    "23": "de",
    "24": "deli",
    "25": "delic",
    "26": "delici",
    "27": "deliciou",
    "28": "delicious</w>",
    "29": "do",
    "30": "dog",
    "31": "dogs</w>",
    "32": "dr",
    "33": "drin",
    "34": "drink",
    "35": "drinking</w>",
    "36": "e",
    "37": "e</w>",
    "38": "eat",
    "39": "eating</w>",
    "40": "ee",
    "41": "f",
    "42": "fl",
    "43": "floo",
    "44": "floor</w>",
    "45": "foo",
    "46": "food</w>",
    "47": "fr",
    "48": "fre",
    "49": "fres",
    "50": "fresh",
    "51": "fresh</w>",
    "52": "g",
    "53": "g</w>",
    "54": "h",
    "55": "ha",
    "56": "has</w>",
    "57": "i",
    "58": "in",
    "59": "ing</w>",
    "60": "is</w>",
    "61": "k",
    "62": "l",
    "63": "li",
    "64": "lik",
    "65": "like</w>",
    "66": "ly</w>",
    "67": "m",
    "68": "man",
    "69": "many</w>",
    "70": "mat",
    "71": "mat</w>",
    "72": "mats</w>",
    "73": "n",
    "74": "n</w>",
    "75": "nee",
    "76": "need</w>",
    "77": "o",
    "78": "on</w>",
    "79": "oo",
    "80": "ou",
    "81": "out",
    "82": "outs",
    "83": "outsi",
    "84": "outsid",
    "85": "outside</w>",
    "86": "p",
    "87": "par",
    "88": "park",
    "89": "park</w>",
    "90": "parks</w>",
    "91": "pe",
    "92": "pea",
    "93": "peac",
    "94": "peace",
    "95": "peacef",
    "96": "peacefu",
    "97": "peaceful",
    "98": "peacefully</w>",
    "99": "pet",
    "100": "pets</w>",
    "101": "pl",
    "102": "pla",
    "103": "play",
    "104": "playe",
    "105": "played</w>",
    "106": "playing</w>",
    "107": "q",
    "108": "qu",
    "109": "qui",
    "110": "quic",
    "111": "quick",
    "112": "quickly</w>",
    "113": "r",
    "114": "r</w>",
    "115": "ran</w>",
    "116": "ru",
    "117": "run",
    "118": "runn",
    "119": "running</w>",
    "120": "s",
    "121": "s</w>",
    "122": "sat</w>",
    "123": "sl",
    "124": "slee",
    "125": "sleep",
    "126": "sleep</w>",
    "127": "sleeping</w>",
    "128": "t",
    "129": "th",
    "130": "the</w>",
    "131": "to",
    "132": "to</w>",
    "133": "toy",
    "134": "toys</w>",
    "135": "tr",
    "136": "tree",
    "137": "trees</w>",
    "138": "u",
    "139": "v",
    "140": "ve",
    "141": "ver",
    "142": "very</w>",
    "143": "w",
    "144": "wat",
    "145": "wate",
    "146": "water</w>",
    "147": "wi",
    "148": "with",
    "149": "with</w>",
    "150": "y",
    "151": "y</w>"
  },
  "vocab_size": 300
}